{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "# Create Knowledge Graph for Novel Coronavirus (COVID-19) Outbreak¶"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "import os\n",
    "from py2neo import Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Open Graph data base"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(password=\"neo4jbinder\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Remove any existing nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x1057e9250>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"MATCH (n) DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Make sure that the core entities are unique"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x1087ee5e0>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"CREATE CONSTRAINT ON (c:City) ASSERT c.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (s:State) ASSERT s.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (k:Country) ASSERT k.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (r:Strain) ASSERT r.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (i:InfectiousDiseaseOutbreak) ASSERT i.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (p:Pathogen) ASSERT p.name IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get absolute path for data directory (LOAD CSV requires absolute path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "data_dir = os.path.abspath(\"../data\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create City-level nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x1087ee550>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_city = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/city_COVID-19.csv' AS e\"\n",
    "query = \"\"\"\n",
    "MERGE (c:City {name:e.City})\n",
    "SET c.location = point({longitude: toFloat(e.Long), latitude: toFloat(e.Lat)})   \n",
    "MERGE (s:State {name:e.State})\n",
    "MERGE (k:Country {name:e.Country})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name:e.Outbreak})\n",
    "        \n",
    "MERGE (c)-[:LOCATED_IN]->(s)\n",
    "MERGE (s)-[:LOCATED_IN]->(k)\n",
    "MERGE (o)-[i:OCCURED_IN {update:e.`Last Update`}]->(c)\n",
    "SET i.confirmed = toInt(e.Confirmed),\n",
    "    i.deaths = toInt(e.Deaths), \n",
    "    i.recovered = toInt(e.Recovered)\n",
    "\"\"\"\n",
    "graph.run(load_city + query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run some test queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>City</th>\n",
       "      <th>Location</th>\n",
       "      <th>State</th>\n",
       "      <th>Country</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Toronto</td>\n",
       "      <td>(-79.3832, 43.6532)</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>Canada</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>London</td>\n",
       "      <td>(-81.2453, 42.9849)</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>Canada</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Boston</td>\n",
       "      <td>(-71.0589, 42.3601)</td>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>(-120.74, 47.7511)</td>\n",
       "      <td>Washington</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>(-118.2437, 34.0522)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Orange</td>\n",
       "      <td>(-117.8531, 33.7879)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Santa Clara</td>\n",
       "      <td>(-121.9552, 37.3541)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>San Benito</td>\n",
       "      <td>(-120.9876, 36.5761)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>San Diego County</td>\n",
       "      <td>(-117.1611, 32.7157)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Tempe</td>\n",
       "      <td>(-111.094, 34.0489)</td>\n",
       "      <td>Arizona</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Madison</td>\n",
       "      <td>(-89.4012, 43.0731)</td>\n",
       "      <td>Wisconsin</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>(-89.3985, 40.6331)</td>\n",
       "      <td>Illinois</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                City              Location          State Country\n",
       "0            Toronto   (-79.3832, 43.6532)        Ontario  Canada\n",
       "1             London   (-81.2453, 42.9849)        Ontario  Canada\n",
       "2             Boston   (-71.0589, 42.3601)  Massachusetts     USA\n",
       "3            Seattle    (-120.74, 47.7511)     Washington     USA\n",
       "4        Los Angeles  (-118.2437, 34.0522)     California     USA\n",
       "5             Orange  (-117.8531, 33.7879)     California     USA\n",
       "6        Santa Clara  (-121.9552, 37.3541)     California     USA\n",
       "7         San Benito  (-120.9876, 36.5761)     California     USA\n",
       "8   San Diego County  (-117.1611, 32.7157)     California     USA\n",
       "9              Tempe   (-111.094, 34.0489)        Arizona     USA\n",
       "10           Madison   (-89.4012, 43.0731)      Wisconsin     USA\n",
       "11           Chicago   (-89.3985, 40.6331)       Illinois     USA"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (c:City)-[l1:LOCATED_IN]->(s:State)-[l2:LOCATED_IN]->(k:Country)\n",
    "RETURN c.name as City, c.location as Location, s.name as State, k.name as Country\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>City</th>\n",
       "      <th>State</th>\n",
       "      <th>Outbreak</th>\n",
       "      <th>Confirmed</th>\n",
       "      <th>Deaths</th>\n",
       "      <th>Recovered</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Orange</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Boston</td>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>London</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Santa Clara</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>Illinois</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Tempe</td>\n",
       "      <td>Arizona</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Madison</td>\n",
       "      <td>Wisconsin</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Toronto</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>San Diego County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>San Benito</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>Washington</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                City          State  Outbreak  Confirmed  Deaths  Recovered\n",
       "0             Orange     California  COVID-19          1       0          0\n",
       "1             Boston  Massachusetts  COVID-19          1       0          0\n",
       "2             London        Ontario  COVID-19          1       0          1\n",
       "3        Santa Clara     California  COVID-19          2       0          0\n",
       "4            Chicago       Illinois  COVID-19          2       0          2\n",
       "5              Tempe        Arizona  COVID-19          1       0          0\n",
       "6            Madison      Wisconsin  COVID-19          1       0          0\n",
       "7            Toronto        Ontario  COVID-19          2       0          0\n",
       "8   San Diego County     California  COVID-19          1       0          0\n",
       "9         San Benito     California  COVID-19          2       0          0\n",
       "10       Los Angeles     California  COVID-19          1       0          0\n",
       "11           Seattle     Washington  COVID-19          1       0          1"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)-[l:OCCURED_IN]->(c:City)-[:LOCATED_IN]->(s:State)\n",
    "RETURN  c.name as City, s.name as State, o.name as Outbreak, l.confirmed as Confirmed, l.deaths as Deaths, l.recovered as Recovered\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create State-level nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x108823460>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_state = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/state_COVID-19.csv' AS e\" \n",
    "query = \"\"\"\n",
    "MERGE (s:State {name:e.State}) \n",
    "SET s.location = point({longitude: toFloat(e.Long), latitude: toFloat(e.Lat)})  \n",
    "MERGE (k:Country {name:e.Country})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name:e.Outbreak})\n",
    "        \n",
    "MERGE (s)-[:LOCATED_IN]->(k)\n",
    "MERGE (o)-[i:OCCURED_IN {update:e.`Last Update`}]->(s)\n",
    "SET i.confirmed = toInt(e.Confirmed),\n",
    "    i.deaths = toInt(e.Deaths), \n",
    "    i.recovered = toInt(e.Recovered)\n",
    "\"\"\"\n",
    "graph.run(load_state + query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run a test query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Location</th>\n",
       "      <th>Country</th>\n",
       "      <th>Outbreak</th>\n",
       "      <th>Confirmed</th>\n",
       "      <th>Deaths</th>\n",
       "      <th>Recovered</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Diamond Princess cruise ship</td>\n",
       "      <td>(129.638, 35.4437)</td>\n",
       "      <td>Others</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>175</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>(114.1694, 22.3193)</td>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>50</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Macau</td>\n",
       "      <td>(113.5439, 22.1987)</td>\n",
       "      <td>Macau</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>10</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>South Australia</td>\n",
       "      <td>(138.6007, -34.9285)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>New South Wales</td>\n",
       "      <td>(151.2093, -33.8688)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Queensland</td>\n",
       "      <td>(153.0251, -27.4698)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>(144.9631, -37.8136)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Taiwan</td>\n",
       "      <td>(120.9605, 23.6978)</td>\n",
       "      <td>Taiwan</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>British Columbia</td>\n",
       "      <td>(-123.121, 49.2827)</td>\n",
       "      <td>Canada</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Ontario</td>\n",
       "      <td>(-80.31425, 43.319050000000004)</td>\n",
       "      <td>Canada</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>(-71.0589, 42.3601)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Washington</td>\n",
       "      <td>(-120.74, 47.7511)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>California</td>\n",
       "      <td>(-119.24014, 34.8972)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>7</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Arizona</td>\n",
       "      <td>(-111.094, 34.0489)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Wisconsin</td>\n",
       "      <td>(-89.4012, 43.0731)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Illinois</td>\n",
       "      <td>(-89.3985, 40.6331)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Xinjiang</td>\n",
       "      <td>(85.17822, 41.11981)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>63</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Shanxi</td>\n",
       "      <td>(112.2922, 37.57769)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>126</td>\n",
       "      <td>0</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Yunnan</td>\n",
       "      <td>(101.4868, 24.97411)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>155</td>\n",
       "      <td>0</td>\n",
       "      <td>23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Tibet</td>\n",
       "      <td>(88.7879, 30.1534)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Shanghai</td>\n",
       "      <td>(121.4554, 31.20327)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>313</td>\n",
       "      <td>1</td>\n",
       "      <td>57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Jiangsu</td>\n",
       "      <td>(119.464, 32.97027)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>570</td>\n",
       "      <td>0</td>\n",
       "      <td>131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Qinghai</td>\n",
       "      <td>(96.02564, 35.65945)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Shandong</td>\n",
       "      <td>(118.1529, 36.34377)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>506</td>\n",
       "      <td>2</td>\n",
       "      <td>98</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Inner Mongolia</td>\n",
       "      <td>(113.9456, 44.09448)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>61</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Liaoning</td>\n",
       "      <td>(122.6086, 41.29284000000001)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>116</td>\n",
       "      <td>1</td>\n",
       "      <td>21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Ningxia</td>\n",
       "      <td>(106.1655, 37.26923)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>64</td>\n",
       "      <td>0</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Tianjin</td>\n",
       "      <td>(117.333, 39.29362)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>113</td>\n",
       "      <td>2</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Shaanxi</td>\n",
       "      <td>(108.8701, 35.19165)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>229</td>\n",
       "      <td>0</td>\n",
       "      <td>42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Jiangxi</td>\n",
       "      <td>(115.7221, 27.61401)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>872</td>\n",
       "      <td>1</td>\n",
       "      <td>170</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Jilin</td>\n",
       "      <td>(126.1917, 43.66657)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>84</td>\n",
       "      <td>1</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Zhejiang</td>\n",
       "      <td>(120.0985, 29.18251)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1145</td>\n",
       "      <td>0</td>\n",
       "      <td>327</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Sichuan</td>\n",
       "      <td>(102.7103, 30.61714000000001)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>451</td>\n",
       "      <td>1</td>\n",
       "      <td>93</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Anhui</td>\n",
       "      <td>(117.2264, 31.82571)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>910</td>\n",
       "      <td>5</td>\n",
       "      <td>128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Hunan</td>\n",
       "      <td>(111.7088, 27.61041)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>968</td>\n",
       "      <td>2</td>\n",
       "      <td>312</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Hubei</td>\n",
       "      <td>(112.2707, 30.97564)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>48206</td>\n",
       "      <td>1310</td>\n",
       "      <td>3441</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Henan</td>\n",
       "      <td>(113.614, 33.882020000000004)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1169</td>\n",
       "      <td>10</td>\n",
       "      <td>258</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Heilongjiang</td>\n",
       "      <td>(127.7622, 47.862)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>395</td>\n",
       "      <td>9</td>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>Hebei</td>\n",
       "      <td>(114.5149, 38.0428)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>265</td>\n",
       "      <td>3</td>\n",
       "      <td>55</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>Hainan</td>\n",
       "      <td>(109.7455, 19.19673)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>157</td>\n",
       "      <td>4</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>Guizhou</td>\n",
       "      <td>(106.8748, 26.81536)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>135</td>\n",
       "      <td>1</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>Guangxi</td>\n",
       "      <td>(108.7881, 23.82908)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>222</td>\n",
       "      <td>2</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>(113.422, 23.33841)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1241</td>\n",
       "      <td>2</td>\n",
       "      <td>284</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Gansu</td>\n",
       "      <td>(103.8343, 36.0611)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>87</td>\n",
       "      <td>2</td>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>Fujian</td>\n",
       "      <td>(117.9895, 26.07783)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>279</td>\n",
       "      <td>0</td>\n",
       "      <td>54</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>Chongqing</td>\n",
       "      <td>(107.874, 30.05718)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>518</td>\n",
       "      <td>3</td>\n",
       "      <td>102</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>(116.4142, 40.18238)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>366</td>\n",
       "      <td>3</td>\n",
       "      <td>68</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                           State                         Location    Country  \\\n",
       "0   Diamond Princess cruise ship               (129.638, 35.4437)     Others   \n",
       "1                      Hong Kong              (114.1694, 22.3193)  Hong Kong   \n",
       "2                          Macau              (113.5439, 22.1987)      Macau   \n",
       "3                South Australia             (138.6007, -34.9285)  Australia   \n",
       "4                New South Wales             (151.2093, -33.8688)  Australia   \n",
       "5                     Queensland             (153.0251, -27.4698)  Australia   \n",
       "6                       Victoria             (144.9631, -37.8136)  Australia   \n",
       "7                         Taiwan              (120.9605, 23.6978)     Taiwan   \n",
       "8               British Columbia              (-123.121, 49.2827)     Canada   \n",
       "9                        Ontario  (-80.31425, 43.319050000000004)     Canada   \n",
       "10                 Massachusetts              (-71.0589, 42.3601)        USA   \n",
       "11                    Washington               (-120.74, 47.7511)        USA   \n",
       "12                    California            (-119.24014, 34.8972)        USA   \n",
       "13                       Arizona              (-111.094, 34.0489)        USA   \n",
       "14                     Wisconsin              (-89.4012, 43.0731)        USA   \n",
       "15                      Illinois              (-89.3985, 40.6331)        USA   \n",
       "16                      Xinjiang             (85.17822, 41.11981)      China   \n",
       "17                        Shanxi             (112.2922, 37.57769)      China   \n",
       "18                        Yunnan             (101.4868, 24.97411)      China   \n",
       "19                         Tibet               (88.7879, 30.1534)      China   \n",
       "20                      Shanghai             (121.4554, 31.20327)      China   \n",
       "21                       Jiangsu              (119.464, 32.97027)      China   \n",
       "22                       Qinghai             (96.02564, 35.65945)      China   \n",
       "23                      Shandong             (118.1529, 36.34377)      China   \n",
       "24                Inner Mongolia             (113.9456, 44.09448)      China   \n",
       "25                      Liaoning    (122.6086, 41.29284000000001)      China   \n",
       "26                       Ningxia             (106.1655, 37.26923)      China   \n",
       "27                       Tianjin              (117.333, 39.29362)      China   \n",
       "28                       Shaanxi             (108.8701, 35.19165)      China   \n",
       "29                       Jiangxi             (115.7221, 27.61401)      China   \n",
       "30                         Jilin             (126.1917, 43.66657)      China   \n",
       "31                      Zhejiang             (120.0985, 29.18251)      China   \n",
       "32                       Sichuan    (102.7103, 30.61714000000001)      China   \n",
       "33                         Anhui             (117.2264, 31.82571)      China   \n",
       "34                         Hunan             (111.7088, 27.61041)      China   \n",
       "35                         Hubei             (112.2707, 30.97564)      China   \n",
       "36                         Henan    (113.614, 33.882020000000004)      China   \n",
       "37                  Heilongjiang               (127.7622, 47.862)      China   \n",
       "38                         Hebei              (114.5149, 38.0428)      China   \n",
       "39                        Hainan             (109.7455, 19.19673)      China   \n",
       "40                       Guizhou             (106.8748, 26.81536)      China   \n",
       "41                       Guangxi             (108.7881, 23.82908)      China   \n",
       "42                     Guangdong              (113.422, 23.33841)      China   \n",
       "43                         Gansu              (103.8343, 36.0611)      China   \n",
       "44                        Fujian             (117.9895, 26.07783)      China   \n",
       "45                     Chongqing              (107.874, 30.05718)      China   \n",
       "46                       Beijing             (116.4142, 40.18238)      China   \n",
       "\n",
       "    Outbreak  Confirmed  Deaths  Recovered  \n",
       "0   COVID-19        175       0          0  \n",
       "1   COVID-19         50       1          1  \n",
       "2   COVID-19         10       0          2  \n",
       "3   COVID-19          2       0          0  \n",
       "4   COVID-19          4       0          2  \n",
       "5   COVID-19          5       0          0  \n",
       "6   COVID-19          4       0          0  \n",
       "7   COVID-19         18       0          1  \n",
       "8   COVID-19          4       0          0  \n",
       "9   COVID-19          3       0          1  \n",
       "10  COVID-19          1       0          0  \n",
       "11  COVID-19          1       0          1  \n",
       "12  COVID-19          7       0          0  \n",
       "13  COVID-19          1       0          0  \n",
       "14  COVID-19          1       0          0  \n",
       "15  COVID-19          2       0          2  \n",
       "16  COVID-19         63       1          3  \n",
       "17  COVID-19        126       0         33  \n",
       "18  COVID-19        155       0         23  \n",
       "19  COVID-19          1       0          1  \n",
       "20  COVID-19        313       1         57  \n",
       "21  COVID-19        570       0        131  \n",
       "22  COVID-19         18       0          9  \n",
       "23  COVID-19        506       2         98  \n",
       "24  COVID-19         61       0          6  \n",
       "25  COVID-19        116       1         21  \n",
       "26  COVID-19         64       0         24  \n",
       "27  COVID-19        113       2         11  \n",
       "28  COVID-19        229       0         42  \n",
       "29  COVID-19        872       1        170  \n",
       "30  COVID-19         84       1         22  \n",
       "31  COVID-19       1145       0        327  \n",
       "32  COVID-19        451       1         93  \n",
       "33  COVID-19        910       5        128  \n",
       "34  COVID-19        968       2        312  \n",
       "35  COVID-19      48206    1310       3441  \n",
       "36  COVID-19       1169      10        258  \n",
       "37  COVID-19        395       9         31  \n",
       "38  COVID-19        265       3         55  \n",
       "39  COVID-19        157       4         27  \n",
       "40  COVID-19        135       1         20  \n",
       "41  COVID-19        222       2         33  \n",
       "42  COVID-19       1241       2        284  \n",
       "43  COVID-19         87       2         31  \n",
       "44  COVID-19        279       0         54  \n",
       "45  COVID-19        518       3        102  \n",
       "46  COVID-19        366       3         68  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)-[l:OCCURED_IN]->(s:State)-[:LOCATED_IN]->(k:Country)\n",
    "RETURN  s.name as State, s.location as Location, k.name as Country, o.name as Outbreak, l.confirmed as Confirmed, l.deaths as Deaths, l.recovered as Recovered\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create Country-level nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x117f33e50>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_country = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/country_COVID-19.csv' AS e\"  \n",
    "query = \"\"\"  \n",
    "MERGE (k:Country {name:e.Country})\n",
    "SET k.location = point({longitude: toFloat(e.Long), latitude: toFloat(e.Lat)})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name:e.Outbreak})\n",
    "        \n",
    "MERGE (o)-[i:OCCURED_IN {update:e.`Last Update`}]->(k)\n",
    "SET i.confirmed = toInt(e.Confirmed),\n",
    "    i.deaths = toInt(e.Deaths), \n",
    "    i.recovered = toInt(e.Recovered)\n",
    "\"\"\"\n",
    "graph.run(load_country + query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run a test query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Country</th>\n",
       "      <th>Location</th>\n",
       "      <th>Outbreak</th>\n",
       "      <th>Confirmed</th>\n",
       "      <th>Deaths</th>\n",
       "      <th>Recovered</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Others</td>\n",
       "      <td>(129.638, 35.4437)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>175</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>(114.1694, 22.3193)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>50</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Macau</td>\n",
       "      <td>(113.5439, 22.1987)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>10</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Australia</td>\n",
       "      <td>(146.94955000000002, -33.520174999999995)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>15</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Taiwan</td>\n",
       "      <td>(120.9605, 23.6978)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Belgium</td>\n",
       "      <td>(4.4699, 50.5039)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Cambodia</td>\n",
       "      <td>(104.991, 12.5657)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Finland</td>\n",
       "      <td>(25.7482, 61.9241)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>France</td>\n",
       "      <td>(2.2137, 46.2276)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>11</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Germany</td>\n",
       "      <td>(10.4515, 51.1657)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>16</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>India</td>\n",
       "      <td>(78.9629, 20.5937)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Italy</td>\n",
       "      <td>(12.5674, 41.8719)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Japan</td>\n",
       "      <td>(139.6503, 35.6762)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>28</td>\n",
       "      <td>0</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Malaysia</td>\n",
       "      <td>(101.9758, 4.2105)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Nepal</td>\n",
       "      <td>(84.124, 28.3949)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Philippines</td>\n",
       "      <td>(121.774, 12.8797)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Russia</td>\n",
       "      <td>(105.3188, 61.524)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Singapore</td>\n",
       "      <td>(103.8198, 1.3521)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>50</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>South Korea</td>\n",
       "      <td>(126.978, 37.5665)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>28</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Spain</td>\n",
       "      <td>(-3.7492, 40.4637)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Sri Lanka</td>\n",
       "      <td>(80.7718, 7.8731)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Sweden</td>\n",
       "      <td>(18.6435, 60.1282)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Thailand</td>\n",
       "      <td>(100.5018, 13.7563)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>33</td>\n",
       "      <td>0</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>United Arab Emirates</td>\n",
       "      <td>(53.8478, 23.4241)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>8</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>United Kingdom</td>\n",
       "      <td>(-3.4360000000000004, 55.3781)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>9</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Vietnam</td>\n",
       "      <td>(105.8342, 21.0278)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>15</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Canada</td>\n",
       "      <td>(-94.58316666666667, 45.30693333333334)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>7</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>USA</td>\n",
       "      <td>(-107.78933000000002, 38.235229999999994)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>13</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>China</td>\n",
       "      <td>(111.56541483870967, 33.354208709677415)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>59805</td>\n",
       "      <td>1366</td>\n",
       "      <td>5915</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Country                                   Location  Outbreak  \\\n",
       "0                 Others                         (129.638, 35.4437)  COVID-19   \n",
       "1              Hong Kong                        (114.1694, 22.3193)  COVID-19   \n",
       "2                  Macau                        (113.5439, 22.1987)  COVID-19   \n",
       "3              Australia  (146.94955000000002, -33.520174999999995)  COVID-19   \n",
       "4                 Taiwan                        (120.9605, 23.6978)  COVID-19   \n",
       "5                Belgium                          (4.4699, 50.5039)  COVID-19   \n",
       "6               Cambodia                         (104.991, 12.5657)  COVID-19   \n",
       "7                Finland                         (25.7482, 61.9241)  COVID-19   \n",
       "8                 France                          (2.2137, 46.2276)  COVID-19   \n",
       "9                Germany                         (10.4515, 51.1657)  COVID-19   \n",
       "10                 India                         (78.9629, 20.5937)  COVID-19   \n",
       "11                 Italy                         (12.5674, 41.8719)  COVID-19   \n",
       "12                 Japan                        (139.6503, 35.6762)  COVID-19   \n",
       "13              Malaysia                         (101.9758, 4.2105)  COVID-19   \n",
       "14                 Nepal                          (84.124, 28.3949)  COVID-19   \n",
       "15           Philippines                         (121.774, 12.8797)  COVID-19   \n",
       "16                Russia                         (105.3188, 61.524)  COVID-19   \n",
       "17             Singapore                         (103.8198, 1.3521)  COVID-19   \n",
       "18           South Korea                         (126.978, 37.5665)  COVID-19   \n",
       "19                 Spain                         (-3.7492, 40.4637)  COVID-19   \n",
       "20             Sri Lanka                          (80.7718, 7.8731)  COVID-19   \n",
       "21                Sweden                         (18.6435, 60.1282)  COVID-19   \n",
       "22              Thailand                        (100.5018, 13.7563)  COVID-19   \n",
       "23  United Arab Emirates                         (53.8478, 23.4241)  COVID-19   \n",
       "24        United Kingdom             (-3.4360000000000004, 55.3781)  COVID-19   \n",
       "25               Vietnam                        (105.8342, 21.0278)  COVID-19   \n",
       "26                Canada    (-94.58316666666667, 45.30693333333334)  COVID-19   \n",
       "27                   USA  (-107.78933000000002, 38.235229999999994)  COVID-19   \n",
       "28                 China   (111.56541483870967, 33.354208709677415)  COVID-19   \n",
       "\n",
       "    Confirmed  Deaths  Recovered  \n",
       "0         175       0          0  \n",
       "1          50       1          1  \n",
       "2          10       0          2  \n",
       "3          15       0          2  \n",
       "4          18       0          1  \n",
       "5           1       0          0  \n",
       "6           1       0          1  \n",
       "7           1       0          1  \n",
       "8          11       0          2  \n",
       "9          16       0          0  \n",
       "10          3       0          0  \n",
       "11          3       0          0  \n",
       "12         28       0          9  \n",
       "13         18       0          3  \n",
       "14          1       0          1  \n",
       "15          3       1          1  \n",
       "16          2       0          2  \n",
       "17         50       0         15  \n",
       "18         28       0          7  \n",
       "19          2       0          0  \n",
       "20          1       0          1  \n",
       "21          1       0          0  \n",
       "22         33       0         10  \n",
       "23          8       0          1  \n",
       "24          9       0          1  \n",
       "25         15       0          6  \n",
       "26          7       0          1  \n",
       "27         13       0          3  \n",
       "28      59805    1366       5915  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)-[l:OCCURED_IN]->(k:Country)\n",
    "RETURN k.name as Country,k.location as Location, o.name as Outbreak, l.confirmed as Confirmed, l.deaths as Deaths, l.recovered as Recovered\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create nodes SARS and MERS data\n",
    "To be added in the future"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x117f9d220>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CREATE (s:InfectiousDiseaseOutbreak {name: 'SARS'})\n",
    "CREATE (m:InfectiousDiseaseOutbreak {name: 'MERS'})\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Outbreak</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SARS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>MERS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>COVID-19</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Outbreak\n",
       "0      SARS\n",
       "1      MERS\n",
       "2  COVID-19"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)\n",
    "RETURN o.name as Outbreak\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add taxonomy data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x117f9dfa0>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "SET p.taxonomyId = '269749'\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: 'COVID-19'})\n",
    "\n",
    "MERGE (p)-[:CAUSES]->(o)\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add strain data at City level"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x117f9d670>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_strains_city = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/strains_city_COVID-19.csv' AS e\" \n",
    "query = \"\"\"  \n",
    "MERGE (c:City {name:e.City})\n",
    "MERGE (s:Strain {name:e.strain})\n",
    "SET s.genbankId = e.genbank_accession\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: '2019-nCoV'})\n",
    "        \n",
    "MERGE (s)-[:FOUND_IN]->(c)\n",
    "MERGE (p)-[:HAS_STRAIN]->(s)\n",
    "\"\"\"\n",
    "graph.run(load_strains_city + query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>City</th>\n",
       "      <th>Strain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>USA/IL1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Boston</td>\n",
       "      <td>USA-MA1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>USA/CA1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>USA-WA1/2020</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          City        Strain\n",
       "0      Chicago  USA/IL1/2020\n",
       "1       Boston  USA-MA1/2020\n",
       "2  Los Angeles  USA/CA1/2020\n",
       "3      Seattle  USA-WA1/2020"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s: Strain)-[:FOUND_IN]->(c:City)\n",
    "RETURN c.name as City, s.name as Strain\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add strain data at State level"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x117f9ddf0>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_strains_country = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/strains_state_COVID-19.csv' AS e\"  \n",
    "query = \"\"\"  \n",
    "MERGE (st:State {name:e.State})\n",
    "MERGE (s:Strain {name:e.strain})\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: 'COVID-19'})\n",
    "        \n",
    "MERGE (s)-[:FOUND_IN]->(st)\n",
    "MERGE (p)-[:HAS_STRAIN]->(s)\n",
    "\"\"\"\n",
    "graph.run(load_strains_country + query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Strain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>Beijing/IVDC-BJ-005/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Chongqing</td>\n",
       "      <td>Chongqing/IVDC-CQ-001/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Chongqing</td>\n",
       "      <td>Chongqing/ZX01/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Chongqing</td>\n",
       "      <td>Chongqing/YC01/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>Shenzhen/SZTH-002/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>California</td>\n",
       "      <td>USA/CA4/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>USA-MA1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>Wisconsin</td>\n",
       "      <td>USA/WI1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>Washington</td>\n",
       "      <td>USA-WA1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>Arizona</td>\n",
       "      <td>USA/AZ1/2020</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>80 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            State                      Strain\n",
       "0         Beijing    Beijing/IVDC-BJ-005/2020\n",
       "1       Chongqing  Chongqing/IVDC-CQ-001/2020\n",
       "2       Chongqing         Chongqing/ZX01/2020\n",
       "3       Chongqing         Chongqing/YC01/2020\n",
       "4       Guangdong      Shenzhen/SZTH-002/2020\n",
       "..            ...                         ...\n",
       "75     California                USA/CA4/2020\n",
       "76  Massachusetts                USA-MA1/2020\n",
       "77      Wisconsin                USA/WI1/2020\n",
       "78     Washington                USA-WA1/2020\n",
       "79        Arizona                USA/AZ1/2020\n",
       "\n",
       "[80 rows x 2 columns]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s: Strain)-[:FOUND_IN]->(st:State)\n",
    "RETURN st.name as State, s.name as Strain\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add strain data at Country level"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x117fa3340>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_strains_country = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/strains_country_COVID-19.csv' AS e\"\n",
    "query = \"\"\"  \n",
    "MERGE (k:Country {name:e.Country})\n",
    "MERGE (s:Strain {name:e.strain})\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: 'COVID-19'})\n",
    "        \n",
    "MERGE (s)-[:FOUND_IN]->(k)\n",
    "MERGE (p)-[:HAS_STRAIN]->(s)\n",
    "\"\"\"\n",
    "graph.run(load_strains_country + query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Country</th>\n",
       "      <th>Strain</th>\n",
       "      <th>GenbankId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/NSW01/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Sydney/3/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/QLD02/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Sydney/2/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/QLD01/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>China</td>\n",
       "      <td>WHU02</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>China</td>\n",
       "      <td>HKU-SZ-007b_2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>China</td>\n",
       "      <td>Wuhan/IPBCAMS-WH-01/2019</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>China</td>\n",
       "      <td>Wuhan/IPBCAMS-WH-03/2019</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>China</td>\n",
       "      <td>Wuhan/WH03/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>101 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       Country                    Strain GenbankId\n",
       "0    Australia      Australia/NSW01/2020      None\n",
       "1    Australia             Sydney/3/2020      None\n",
       "2    Australia      Australia/QLD02/2020      None\n",
       "3    Australia             Sydney/2/2020      None\n",
       "4    Australia      Australia/QLD01/2020      None\n",
       "..         ...                       ...       ...\n",
       "96       China                     WHU02      None\n",
       "97       China          HKU-SZ-007b_2020      None\n",
       "98       China  Wuhan/IPBCAMS-WH-01/2019      None\n",
       "99       China  Wuhan/IPBCAMS-WH-03/2019      None\n",
       "100      China           Wuhan/WH03/2020      None\n",
       "\n",
       "[101 rows x 3 columns]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s: Strain)-[:FOUND_IN]->(k:Country)\n",
    "RETURN k.name as Country, s.name as Strain, s.genbankId as GenbankId\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Strain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nonthaburi/74/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Singapore/3/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Japan/KY-V-029/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>France/IDF0373/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Singapore/1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>HKU-SZ-004_2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>Wuhan-Hu-1/2019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>HKU-SZ-005b_2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>USA/AZ1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>Wuhan/IPBCAMS-WH-02/2019</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>101 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       Strain\n",
       "0          Nonthaburi/74/2020\n",
       "1            Singapore/3/2020\n",
       "2         Japan/KY-V-029/2020\n",
       "3         France/IDF0373/2020\n",
       "4            Singapore/1/2020\n",
       "..                        ...\n",
       "96            HKU-SZ-004_2020\n",
       "97            Wuhan-Hu-1/2019\n",
       "98           HKU-SZ-005b_2020\n",
       "99               USA/AZ1/2020\n",
       "100  Wuhan/IPBCAMS-WH-02/2019\n",
       "\n",
       "[101 rows x 1 columns]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p: Pathogen)-[:HAS_STRAIN]-(s:Strain)\n",
    "RETURN s.name as Strain\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
