{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "# Create Knowledge Graph for Novel Coronavirus (COVID-19) Outbreak¶"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "import os\n",
    "from py2neo import Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Open Graph data base"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(password=\"neo4jbinder\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Remove any existing nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x1102668e0>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"MATCH (n) DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Make sure that the core entities are unique"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x11027ae80>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"CREATE CONSTRAINT ON (c:City) ASSERT c.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (s:State) ASSERT s.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (k:Country) ASSERT k.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (r:Strain) ASSERT r.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (i:InfectiousDiseaseOutbreak) ASSERT i.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (p:Pathogen) ASSERT p.name IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get absolute path for data directory (LOAD CSV requires absolute path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "data_dir = os.path.abspath(\"../data\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create City-level nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x1102bd310>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_city = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/city_COVID-19.csv' AS e\"\n",
    "query = \"\"\"\n",
    "MERGE (c:City {name:e.City})\n",
    "SET c.location = point({longitude: toFloat(e.Long), latitude: toFloat(e.Lat)})   \n",
    "MERGE (s:State {name:e.State})\n",
    "MERGE (k:Country {name:e.Country})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name:e.Outbreak})\n",
    "        \n",
    "MERGE (c)-[:LOCATED_IN]->(s)\n",
    "MERGE (s)-[:LOCATED_IN]->(k)\n",
    "MERGE (o)-[i:OCCURED_IN {update:e.`Last Update`}]->(c)\n",
    "SET i.confirmed = toInt(e.Confirmed),\n",
    "    i.deaths = toInt(e.Deaths), \n",
    "    i.recovered = toInt(e.Recovered)\n",
    "\"\"\"\n",
    "graph.run(load_city + query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run some test queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>City</th>\n",
       "      <th>Location</th>\n",
       "      <th>State</th>\n",
       "      <th>Country</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>London</td>\n",
       "      <td>(-81.2453, 42.9849)</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>Canada</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Toronto</td>\n",
       "      <td>(-79.3832, 43.6532)</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>Canada</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Madison</td>\n",
       "      <td>(-89.4012, 43.0731)</td>\n",
       "      <td>Wisconsin</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>(-89.3985, 40.6331)</td>\n",
       "      <td>Illinois</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Boston</td>\n",
       "      <td>(-71.0589, 42.3601)</td>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>(-120.74, 47.7511)</td>\n",
       "      <td>Washington</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Tempe</td>\n",
       "      <td>(-111.094, 34.0489)</td>\n",
       "      <td>Arizona</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>San Diego County</td>\n",
       "      <td>(-117.1611, 32.7157)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>(-118.2437, 34.0522)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>San Benito</td>\n",
       "      <td>(-120.9876, 36.5761)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Santa Clara</td>\n",
       "      <td>(-121.9552, 37.3541)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Orange</td>\n",
       "      <td>(-117.8531, 33.7879)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                City              Location          State Country\n",
       "0             London   (-81.2453, 42.9849)        Ontario  Canada\n",
       "1            Toronto   (-79.3832, 43.6532)        Ontario  Canada\n",
       "2            Madison   (-89.4012, 43.0731)      Wisconsin     USA\n",
       "3            Chicago   (-89.3985, 40.6331)       Illinois     USA\n",
       "4             Boston   (-71.0589, 42.3601)  Massachusetts     USA\n",
       "5            Seattle    (-120.74, 47.7511)     Washington     USA\n",
       "6              Tempe   (-111.094, 34.0489)        Arizona     USA\n",
       "7   San Diego County  (-117.1611, 32.7157)     California     USA\n",
       "8        Los Angeles  (-118.2437, 34.0522)     California     USA\n",
       "9         San Benito  (-120.9876, 36.5761)     California     USA\n",
       "10       Santa Clara  (-121.9552, 37.3541)     California     USA\n",
       "11            Orange  (-117.8531, 33.7879)     California     USA"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (c:City)-[l1:LOCATED_IN]->(s:State)-[l2:LOCATED_IN]->(k:Country)\n",
    "RETURN c.name as City, c.location as Location, s.name as State, k.name as Country\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>City</th>\n",
       "      <th>State</th>\n",
       "      <th>Outbreak</th>\n",
       "      <th>Confirmed</th>\n",
       "      <th>Deaths</th>\n",
       "      <th>Recovered</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>Washington</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Tempe</td>\n",
       "      <td>Arizona</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Toronto</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Boston</td>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Orange</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Madison</td>\n",
       "      <td>Wisconsin</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>San Diego County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>London</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Santa Clara</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>Illinois</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>San Benito</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                City          State  Outbreak  Confirmed  Deaths  Recovered\n",
       "0            Seattle     Washington  COVID-19          1       0          1\n",
       "1              Tempe        Arizona  COVID-19          1       0          0\n",
       "2            Toronto        Ontario  COVID-19          2       0          0\n",
       "3             Boston  Massachusetts  COVID-19          1       0          0\n",
       "4             Orange     California  COVID-19          1       0          0\n",
       "5            Madison      Wisconsin  COVID-19          1       0          0\n",
       "6   San Diego County     California  COVID-19          1       0          0\n",
       "7             London        Ontario  COVID-19          1       0          0\n",
       "8        Santa Clara     California  COVID-19          2       0          0\n",
       "9            Chicago       Illinois  COVID-19          2       0          2\n",
       "10       Los Angeles     California  COVID-19          1       0          0\n",
       "11        San Benito     California  COVID-19          2       0          0"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)-[l:OCCURED_IN]->(c:City)-[:LOCATED_IN]->(s:State)\n",
    "RETURN  c.name as City, s.name as State, o.name as Outbreak, l.confirmed as Confirmed, l.deaths as Deaths, l.recovered as Recovered\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create State-level nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x10e2f7f10>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_state = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/state_COVID-19.csv' AS e\" \n",
    "query = \"\"\"\n",
    "MERGE (s:State {name:e.State}) \n",
    "SET s.location = point({longitude: toFloat(e.Long), latitude: toFloat(e.Lat)})  \n",
    "MERGE (k:Country {name:e.Country})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name:e.Outbreak})\n",
    "        \n",
    "MERGE (s)-[:LOCATED_IN]->(k)\n",
    "MERGE (o)-[i:OCCURED_IN {update:e.`Last Update`}]->(s)\n",
    "SET i.confirmed = toInt(e.Confirmed),\n",
    "    i.deaths = toInt(e.Deaths), \n",
    "    i.recovered = toInt(e.Recovered)\n",
    "\"\"\"\n",
    "graph.run(load_state + query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run a test query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Location</th>\n",
       "      <th>Country</th>\n",
       "      <th>Outbreak</th>\n",
       "      <th>Confirmed</th>\n",
       "      <th>Deaths</th>\n",
       "      <th>Recovered</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Macau</td>\n",
       "      <td>(113.5439, 22.1987)</td>\n",
       "      <td>Macau</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>10</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>South Australia</td>\n",
       "      <td>(138.6007, -34.9285)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>New South Wales</td>\n",
       "      <td>(151.2093, -33.8688)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Queensland</td>\n",
       "      <td>(153.0251, -27.4698)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>(144.9631, -37.8136)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Taiwan</td>\n",
       "      <td>(120.9605, 23.6978)</td>\n",
       "      <td>Taiwan</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>British Columbia</td>\n",
       "      <td>(-123.12100000000001, 49.2827)</td>\n",
       "      <td>Canada</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Ontario</td>\n",
       "      <td>(-80.31425, 43.319050000000004)</td>\n",
       "      <td>Canada</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Wisconsin</td>\n",
       "      <td>(-89.4012, 43.0731)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Illinois</td>\n",
       "      <td>(-89.3985, 40.6331)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>(-71.0589, 42.3601)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Washington</td>\n",
       "      <td>(-120.74, 47.7511)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Arizona</td>\n",
       "      <td>(-111.094, 34.0489)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>California</td>\n",
       "      <td>(-119.24014, 34.8972)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>7</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Anhui</td>\n",
       "      <td>(117.2264, 31.825709999999997)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>889</td>\n",
       "      <td>4</td>\n",
       "      <td>127</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Xinjiang</td>\n",
       "      <td>(85.17822, 41.11981)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>59</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Shaanxi</td>\n",
       "      <td>(108.8701, 35.19165)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>225</td>\n",
       "      <td>0</td>\n",
       "      <td>43</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>(116.4142, 40.18238)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>352</td>\n",
       "      <td>3</td>\n",
       "      <td>56</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Jiangxi</td>\n",
       "      <td>(115.7221, 27.614009999999997)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>844</td>\n",
       "      <td>1</td>\n",
       "      <td>152</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Tibet</td>\n",
       "      <td>(88.7879, 30.1534)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Liaoning</td>\n",
       "      <td>(122.6086, 41.29284000000001)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>116</td>\n",
       "      <td>1</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Chongqing</td>\n",
       "      <td>(107.874, 30.05718)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>509</td>\n",
       "      <td>3</td>\n",
       "      <td>87</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Shandong</td>\n",
       "      <td>(118.1529, 36.34377)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>497</td>\n",
       "      <td>2</td>\n",
       "      <td>92</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Sichuan</td>\n",
       "      <td>(102.7103, 30.61714000000001)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>436</td>\n",
       "      <td>1</td>\n",
       "      <td>92</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Jilin</td>\n",
       "      <td>(126.1917, 43.66657)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>83</td>\n",
       "      <td>1</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Shanghai</td>\n",
       "      <td>(121.4554, 31.20327)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>311</td>\n",
       "      <td>1</td>\n",
       "      <td>57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Zhejiang</td>\n",
       "      <td>(120.0985, 29.182509999999997)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1131</td>\n",
       "      <td>0</td>\n",
       "      <td>321</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Yunnan</td>\n",
       "      <td>(101.4868, 24.97411)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>154</td>\n",
       "      <td>0</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Qinghai</td>\n",
       "      <td>(96.02564, 35.65945)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Shanxi</td>\n",
       "      <td>(112.2922, 37.577690000000004)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>124</td>\n",
       "      <td>0</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Tianjin</td>\n",
       "      <td>(117.333, 39.293620000000004)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>112</td>\n",
       "      <td>2</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Ningxia</td>\n",
       "      <td>(106.1655, 37.26923)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>58</td>\n",
       "      <td>0</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Jiangsu</td>\n",
       "      <td>(119.464, 32.97027)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>543</td>\n",
       "      <td>0</td>\n",
       "      <td>125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Inner Mongolia</td>\n",
       "      <td>(113.9456, 44.09448)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>60</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Hunan</td>\n",
       "      <td>(111.7088, 27.610409999999998)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>946</td>\n",
       "      <td>2</td>\n",
       "      <td>304</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Hubei</td>\n",
       "      <td>(112.2707, 30.975640000000002)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>33366</td>\n",
       "      <td>1068</td>\n",
       "      <td>2686</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Henan</td>\n",
       "      <td>(113.61399999999999, 33.882020000000004)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1135</td>\n",
       "      <td>8</td>\n",
       "      <td>246</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Heilongjiang</td>\n",
       "      <td>(127.7622, 47.861999999999995)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>378</td>\n",
       "      <td>8</td>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>Hebei</td>\n",
       "      <td>(114.5149, 38.0428)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>251</td>\n",
       "      <td>2</td>\n",
       "      <td>54</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>Hainan</td>\n",
       "      <td>(109.7455, 19.19673)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>157</td>\n",
       "      <td>3</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>Guizhou</td>\n",
       "      <td>(106.8748, 26.81536)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>133</td>\n",
       "      <td>1</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>Guangxi</td>\n",
       "      <td>(108.7881, 23.829079999999998)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>222</td>\n",
       "      <td>1</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>(113.42200000000001, 23.33841)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1219</td>\n",
       "      <td>1</td>\n",
       "      <td>275</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Gansu</td>\n",
       "      <td>(103.8343, 36.0611)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>86</td>\n",
       "      <td>2</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>Fujian</td>\n",
       "      <td>(117.9895, 26.07783)</td>\n",
       "      <td>China</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>272</td>\n",
       "      <td>0</td>\n",
       "      <td>53</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>Diamond Princess cruise ship</td>\n",
       "      <td>(129.638, 35.4437)</td>\n",
       "      <td>Others</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>175</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>(114.1694, 22.3193)</td>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>50</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                           State                                  Location  \\\n",
       "0                          Macau                       (113.5439, 22.1987)   \n",
       "1                South Australia                      (138.6007, -34.9285)   \n",
       "2                New South Wales                      (151.2093, -33.8688)   \n",
       "3                     Queensland                      (153.0251, -27.4698)   \n",
       "4                       Victoria                      (144.9631, -37.8136)   \n",
       "5                         Taiwan                       (120.9605, 23.6978)   \n",
       "6               British Columbia            (-123.12100000000001, 49.2827)   \n",
       "7                        Ontario           (-80.31425, 43.319050000000004)   \n",
       "8                      Wisconsin                       (-89.4012, 43.0731)   \n",
       "9                       Illinois                       (-89.3985, 40.6331)   \n",
       "10                 Massachusetts                       (-71.0589, 42.3601)   \n",
       "11                    Washington                        (-120.74, 47.7511)   \n",
       "12                       Arizona                       (-111.094, 34.0489)   \n",
       "13                    California                     (-119.24014, 34.8972)   \n",
       "14                         Anhui            (117.2264, 31.825709999999997)   \n",
       "15                      Xinjiang                      (85.17822, 41.11981)   \n",
       "16                       Shaanxi                      (108.8701, 35.19165)   \n",
       "17                       Beijing                      (116.4142, 40.18238)   \n",
       "18                       Jiangxi            (115.7221, 27.614009999999997)   \n",
       "19                         Tibet                        (88.7879, 30.1534)   \n",
       "20                      Liaoning             (122.6086, 41.29284000000001)   \n",
       "21                     Chongqing                       (107.874, 30.05718)   \n",
       "22                      Shandong                      (118.1529, 36.34377)   \n",
       "23                       Sichuan             (102.7103, 30.61714000000001)   \n",
       "24                         Jilin                      (126.1917, 43.66657)   \n",
       "25                      Shanghai                      (121.4554, 31.20327)   \n",
       "26                      Zhejiang            (120.0985, 29.182509999999997)   \n",
       "27                        Yunnan                      (101.4868, 24.97411)   \n",
       "28                       Qinghai                      (96.02564, 35.65945)   \n",
       "29                        Shanxi            (112.2922, 37.577690000000004)   \n",
       "30                       Tianjin             (117.333, 39.293620000000004)   \n",
       "31                       Ningxia                      (106.1655, 37.26923)   \n",
       "32                       Jiangsu                       (119.464, 32.97027)   \n",
       "33                Inner Mongolia                      (113.9456, 44.09448)   \n",
       "34                         Hunan            (111.7088, 27.610409999999998)   \n",
       "35                         Hubei            (112.2707, 30.975640000000002)   \n",
       "36                         Henan  (113.61399999999999, 33.882020000000004)   \n",
       "37                  Heilongjiang            (127.7622, 47.861999999999995)   \n",
       "38                         Hebei                       (114.5149, 38.0428)   \n",
       "39                        Hainan                      (109.7455, 19.19673)   \n",
       "40                       Guizhou                      (106.8748, 26.81536)   \n",
       "41                       Guangxi            (108.7881, 23.829079999999998)   \n",
       "42                     Guangdong            (113.42200000000001, 23.33841)   \n",
       "43                         Gansu                       (103.8343, 36.0611)   \n",
       "44                        Fujian                      (117.9895, 26.07783)   \n",
       "45  Diamond Princess cruise ship                        (129.638, 35.4437)   \n",
       "46                     Hong Kong                       (114.1694, 22.3193)   \n",
       "\n",
       "      Country  Outbreak  Confirmed  Deaths  Recovered  \n",
       "0       Macau  COVID-19         10       0          2  \n",
       "1   Australia  COVID-19          2       0          0  \n",
       "2   Australia  COVID-19          4       0          2  \n",
       "3   Australia  COVID-19          5       0          0  \n",
       "4   Australia  COVID-19          4       0          0  \n",
       "5      Taiwan  COVID-19         18       0          1  \n",
       "6      Canada  COVID-19          4       0          0  \n",
       "7      Canada  COVID-19          3       0          0  \n",
       "8         USA  COVID-19          1       0          0  \n",
       "9         USA  COVID-19          2       0          2  \n",
       "10        USA  COVID-19          1       0          0  \n",
       "11        USA  COVID-19          1       0          1  \n",
       "12        USA  COVID-19          1       0          0  \n",
       "13        USA  COVID-19          7       0          0  \n",
       "14      China  COVID-19        889       4        127  \n",
       "15      China  COVID-19         59       0          3  \n",
       "16      China  COVID-19        225       0         43  \n",
       "17      China  COVID-19        352       3         56  \n",
       "18      China  COVID-19        844       1        152  \n",
       "19      China  COVID-19          1       0          1  \n",
       "20      China  COVID-19        116       1         20  \n",
       "21      China  COVID-19        509       3         87  \n",
       "22      China  COVID-19        497       2         92  \n",
       "23      China  COVID-19        436       1         92  \n",
       "24      China  COVID-19         83       1         22  \n",
       "25      China  COVID-19        311       1         57  \n",
       "26      China  COVID-19       1131       0        321  \n",
       "27      China  COVID-19        154       0         26  \n",
       "28      China  COVID-19         18       0          9  \n",
       "29      China  COVID-19        124       0         33  \n",
       "30      China  COVID-19        112       2         11  \n",
       "31      China  COVID-19         58       0         24  \n",
       "32      China  COVID-19        543       0        125  \n",
       "33      China  COVID-19         60       0          6  \n",
       "34      China  COVID-19        946       2        304  \n",
       "35      China  COVID-19      33366    1068       2686  \n",
       "36      China  COVID-19       1135       8        246  \n",
       "37      China  COVID-19        378       8         31  \n",
       "38      China  COVID-19        251       2         54  \n",
       "39      China  COVID-19        157       3         27  \n",
       "40      China  COVID-19        133       1         18  \n",
       "41      China  COVID-19        222       1         32  \n",
       "42      China  COVID-19       1219       1        275  \n",
       "43      China  COVID-19         86       2         29  \n",
       "44      China  COVID-19        272       0         53  \n",
       "45     Others  COVID-19        175       0          0  \n",
       "46  Hong Kong  COVID-19         50       1          1  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)-[l:OCCURED_IN]->(s:State)-[:LOCATED_IN]->(k:Country)\n",
    "RETURN  s.name as State, s.location as Location, k.name as Country, o.name as Outbreak, l.confirmed as Confirmed, l.deaths as Deaths, l.recovered as Recovered\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create Country-level nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x10d1abd90>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_country = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/country_COVID-19.csv' AS e\"  \n",
    "query = \"\"\"  \n",
    "MERGE (k:Country {name:e.Country})\n",
    "SET k.location = point({longitude: toFloat(e.Long), latitude: toFloat(e.Lat)})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name:e.Outbreak})\n",
    "        \n",
    "MERGE (o)-[i:OCCURED_IN {update:e.`Last Update`}]->(k)\n",
    "SET i.confirmed = toInt(e.Confirmed),\n",
    "    i.deaths = toInt(e.Deaths), \n",
    "    i.recovered = toInt(e.Recovered)\n",
    "\"\"\"\n",
    "graph.run(load_country + query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run a test query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Country</th>\n",
       "      <th>Location</th>\n",
       "      <th>Outbreak</th>\n",
       "      <th>Confirmed</th>\n",
       "      <th>Deaths</th>\n",
       "      <th>Recovered</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Macau</td>\n",
       "      <td>(113.5439, 22.1987)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>10</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Australia</td>\n",
       "      <td>(146.94955000000002, -33.520174999999995)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>15</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Taiwan</td>\n",
       "      <td>(120.9605, 23.6978)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Belgium</td>\n",
       "      <td>(4.4699, 50.5039)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Cambodia</td>\n",
       "      <td>(104.991, 12.5657)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Finland</td>\n",
       "      <td>(25.7482, 61.9241)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>France</td>\n",
       "      <td>(2.2137, 46.2276)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>11</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Germany</td>\n",
       "      <td>(10.4515, 51.1657)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>16</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>India</td>\n",
       "      <td>(78.9629, 20.5937)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Italy</td>\n",
       "      <td>(12.5674, 41.8719)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Japan</td>\n",
       "      <td>(139.6503, 35.6762)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>28</td>\n",
       "      <td>0</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Malaysia</td>\n",
       "      <td>(101.9758, 4.2105)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Nepal</td>\n",
       "      <td>(84.124, 28.3949)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Philippines</td>\n",
       "      <td>(121.774, 12.8797)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Russia</td>\n",
       "      <td>(105.3188, 61.523999999999994)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Singapore</td>\n",
       "      <td>(103.8198, 1.3521)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>47</td>\n",
       "      <td>0</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>South Korea</td>\n",
       "      <td>(126.978, 37.5665)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>28</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Spain</td>\n",
       "      <td>(-3.7492, 40.4637)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Sri Lanka</td>\n",
       "      <td>(80.7718, 7.8731)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Sweden</td>\n",
       "      <td>(18.6435, 60.1282)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Thailand</td>\n",
       "      <td>(100.5018, 13.7563)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>33</td>\n",
       "      <td>0</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>United Arab Emirates</td>\n",
       "      <td>(53.8478, 23.4241)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>8</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>United Kingdom</td>\n",
       "      <td>(-3.4360000000000004, 55.3781)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>8</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Vietnam</td>\n",
       "      <td>(105.8342, 21.0278)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>15</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Canada</td>\n",
       "      <td>(-94.58316666666667, 45.30693333333334)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>7</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>USA</td>\n",
       "      <td>(-107.78933000000002, 38.235229999999994)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>13</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>China</td>\n",
       "      <td>(111.56541483870967, 33.354208709677415)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>44687</td>\n",
       "      <td>1115</td>\n",
       "      <td>5062</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Others</td>\n",
       "      <td>(129.638, 35.4437)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>175</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>(114.1694, 22.3193)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>50</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Country                                   Location  Outbreak  \\\n",
       "0                  Macau                        (113.5439, 22.1987)  COVID-19   \n",
       "1              Australia  (146.94955000000002, -33.520174999999995)  COVID-19   \n",
       "2                 Taiwan                        (120.9605, 23.6978)  COVID-19   \n",
       "3                Belgium                          (4.4699, 50.5039)  COVID-19   \n",
       "4               Cambodia                         (104.991, 12.5657)  COVID-19   \n",
       "5                Finland                         (25.7482, 61.9241)  COVID-19   \n",
       "6                 France                          (2.2137, 46.2276)  COVID-19   \n",
       "7                Germany                         (10.4515, 51.1657)  COVID-19   \n",
       "8                  India                         (78.9629, 20.5937)  COVID-19   \n",
       "9                  Italy                         (12.5674, 41.8719)  COVID-19   \n",
       "10                 Japan                        (139.6503, 35.6762)  COVID-19   \n",
       "11              Malaysia                         (101.9758, 4.2105)  COVID-19   \n",
       "12                 Nepal                          (84.124, 28.3949)  COVID-19   \n",
       "13           Philippines                         (121.774, 12.8797)  COVID-19   \n",
       "14                Russia             (105.3188, 61.523999999999994)  COVID-19   \n",
       "15             Singapore                         (103.8198, 1.3521)  COVID-19   \n",
       "16           South Korea                         (126.978, 37.5665)  COVID-19   \n",
       "17                 Spain                         (-3.7492, 40.4637)  COVID-19   \n",
       "18             Sri Lanka                          (80.7718, 7.8731)  COVID-19   \n",
       "19                Sweden                         (18.6435, 60.1282)  COVID-19   \n",
       "20              Thailand                        (100.5018, 13.7563)  COVID-19   \n",
       "21  United Arab Emirates                         (53.8478, 23.4241)  COVID-19   \n",
       "22        United Kingdom             (-3.4360000000000004, 55.3781)  COVID-19   \n",
       "23               Vietnam                        (105.8342, 21.0278)  COVID-19   \n",
       "24                Canada    (-94.58316666666667, 45.30693333333334)  COVID-19   \n",
       "25                   USA  (-107.78933000000002, 38.235229999999994)  COVID-19   \n",
       "26                 China   (111.56541483870967, 33.354208709677415)  COVID-19   \n",
       "27                Others                         (129.638, 35.4437)  COVID-19   \n",
       "28             Hong Kong                        (114.1694, 22.3193)  COVID-19   \n",
       "\n",
       "    Confirmed  Deaths  Recovered  \n",
       "0          10       0          2  \n",
       "1          15       0          2  \n",
       "2          18       0          1  \n",
       "3           1       0          0  \n",
       "4           1       0          1  \n",
       "5           1       0          1  \n",
       "6          11       0          0  \n",
       "7          16       0          0  \n",
       "8           3       0          0  \n",
       "9           3       0          0  \n",
       "10         28       0          9  \n",
       "11         18       0          3  \n",
       "12          1       0          1  \n",
       "13          3       1          1  \n",
       "14          2       0          2  \n",
       "15         47       0          9  \n",
       "16         28       0          7  \n",
       "17          2       0          0  \n",
       "18          1       0          1  \n",
       "19          1       0          0  \n",
       "20         33       0         10  \n",
       "21          8       0          1  \n",
       "22          8       0          0  \n",
       "23         15       0          6  \n",
       "24          7       0          0  \n",
       "25         13       0          3  \n",
       "26      44687    1115       5062  \n",
       "27        175       0          0  \n",
       "28         50       1          1  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)-[l:OCCURED_IN]->(k:Country)\n",
    "RETURN k.name as Country,k.location as Location, o.name as Outbreak, l.confirmed as Confirmed, l.deaths as Deaths, l.recovered as Recovered\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create nodes SARS and MERS data\n",
    "To be added in the future"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x1102bd0d0>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CREATE (s:InfectiousDiseaseOutbreak {name: 'SARS'})\n",
    "CREATE (m:InfectiousDiseaseOutbreak {name: 'MERS'})\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Outbreak</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SARS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>MERS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>COVID-19</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Outbreak\n",
       "0      SARS\n",
       "1      MERS\n",
       "2  COVID-19"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)\n",
    "RETURN o.name as Outbreak\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add taxonomy data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x11f997c10>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "SET p.taxonomyId = '269749'\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: 'COVID-19'})\n",
    "\n",
    "MERGE (p)-[:CAUSES]->(o)\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add strain data at City level"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x11f997b20>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_strains_city = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/strains_city_COVID-19.csv' AS e\" \n",
    "query = \"\"\"  \n",
    "MERGE (c:City {name:e.City})\n",
    "MERGE (s:Strain {name:e.strain})\n",
    "SET s.genbankId = e.genbank_accession\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: '2019-nCoV'})\n",
    "        \n",
    "MERGE (s)-[:FOUND_IN]->(c)\n",
    "MERGE (p)-[:HAS_STRAIN]->(s)\n",
    "\"\"\"\n",
    "graph.run(load_strains_city + query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>City</th>\n",
       "      <th>Strain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Chicago</td>\n",
       "      <td>USA/IL1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Boston</td>\n",
       "      <td>USA-MA1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>USA/CA1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Seattle</td>\n",
       "      <td>USA-WA1/2020</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          City        Strain\n",
       "0      Chicago  USA/IL1/2020\n",
       "1       Boston  USA-MA1/2020\n",
       "2  Los Angeles  USA/CA1/2020\n",
       "3      Seattle  USA-WA1/2020"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s: Strain)-[:FOUND_IN]->(c:City)\n",
    "RETURN c.name as City, s.name as Strain\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add strain data at State level"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x11f9f4a00>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_strains_country = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/strains_state_COVID-19.csv' AS e\"  \n",
    "query = \"\"\"  \n",
    "MERGE (st:State {name:e.State})\n",
    "MERGE (s:Strain {name:e.strain})\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: 'COVID-19'})\n",
    "        \n",
    "MERGE (s)-[:FOUND_IN]->(st)\n",
    "MERGE (p)-[:HAS_STRAIN]->(s)\n",
    "\"\"\"\n",
    "graph.run(load_strains_country + query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Strain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hubei</td>\n",
       "      <td>WHU01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hubei</td>\n",
       "      <td>Wuhan/IVDC-HB-04/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hubei</td>\n",
       "      <td>Wuhan/IPBCAMS-WH-01/2019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Hubei</td>\n",
       "      <td>WHU02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Hubei</td>\n",
       "      <td>Wuhan/IPBCAMS-WH-04/2019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>HKU-SZ-004_2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>Guangdong/20SF013/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>Guangdong/20SF028/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>Guangdong/20SF174/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>Guangdong/20SF025/2020</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>80 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        State                    Strain\n",
       "0       Hubei                     WHU01\n",
       "1       Hubei     Wuhan/IVDC-HB-04/2020\n",
       "2       Hubei  Wuhan/IPBCAMS-WH-01/2019\n",
       "3       Hubei                     WHU02\n",
       "4       Hubei  Wuhan/IPBCAMS-WH-04/2019\n",
       "..        ...                       ...\n",
       "75  Guangdong           HKU-SZ-004_2020\n",
       "76  Guangdong    Guangdong/20SF013/2020\n",
       "77  Guangdong    Guangdong/20SF028/2020\n",
       "78  Guangdong    Guangdong/20SF174/2020\n",
       "79  Guangdong    Guangdong/20SF025/2020\n",
       "\n",
       "[80 rows x 2 columns]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s: Strain)-[:FOUND_IN]->(st:State)\n",
    "RETURN st.name as State, s.name as Strain\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add strain data at Country level"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x1102668b0>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_strains_country = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/strains_country_COVID-19.csv' AS e\"\n",
    "query = \"\"\"  \n",
    "MERGE (k:Country {name:e.Country})\n",
    "MERGE (s:Strain {name:e.strain})\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: 'COVID-19'})\n",
    "        \n",
    "MERGE (s)-[:FOUND_IN]->(k)\n",
    "MERGE (p)-[:HAS_STRAIN]->(s)\n",
    "\"\"\"\n",
    "graph.run(load_strains_country + query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Country</th>\n",
       "      <th>Strain</th>\n",
       "      <th>GenbankId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/VIC01/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/NSW01/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/QLD01/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Sydney/2/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/QLD02/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>China</td>\n",
       "      <td>Chongqing/IVDC-CQ-001/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>China</td>\n",
       "      <td>Wuhan/IVDC-HB-envF13-20/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>China</td>\n",
       "      <td>Wuhan/WIV06/2019</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>China</td>\n",
       "      <td>Wuhan/IVDC-HB-05/2019</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>China</td>\n",
       "      <td>Guangdong/20SF040/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>101 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       Country                        Strain GenbankId\n",
       "0    Australia          Australia/VIC01/2020      None\n",
       "1    Australia          Australia/NSW01/2020      None\n",
       "2    Australia          Australia/QLD01/2020      None\n",
       "3    Australia                 Sydney/2/2020      None\n",
       "4    Australia          Australia/QLD02/2020      None\n",
       "..         ...                           ...       ...\n",
       "96       China    Chongqing/IVDC-CQ-001/2020      None\n",
       "97       China  Wuhan/IVDC-HB-envF13-20/2020      None\n",
       "98       China              Wuhan/WIV06/2019      None\n",
       "99       China         Wuhan/IVDC-HB-05/2019      None\n",
       "100      China        Guangdong/20SF040/2020      None\n",
       "\n",
       "[101 rows x 3 columns]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s: Strain)-[:FOUND_IN]->(k:Country)\n",
    "RETURN k.name as Country, s.name as Strain, s.genbankId as GenbankId\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Strain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nonthaburi/61/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Japan/TY-WK-521/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Germany/BavPat1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Korea/KCDC03/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Japan/AI/I-004/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>HKU-SZ-007a_2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>Wuhan/IPBCAMS-WH-02/2019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>HKU-SZ-007c_2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>USA/CA2/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>Wuhan/IPBCAMS-WH-05/2020</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>101 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       Strain\n",
       "0          Nonthaburi/61/2020\n",
       "1        Japan/TY-WK-521/2020\n",
       "2        Germany/BavPat1/2020\n",
       "3           Korea/KCDC03/2020\n",
       "4         Japan/AI/I-004/2020\n",
       "..                        ...\n",
       "96           HKU-SZ-007a_2020\n",
       "97   Wuhan/IPBCAMS-WH-02/2019\n",
       "98           HKU-SZ-007c_2020\n",
       "99               USA/CA2/2020\n",
       "100  Wuhan/IPBCAMS-WH-05/2020\n",
       "\n",
       "[101 rows x 1 columns]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p: Pathogen)-[:HAS_STRAIN]-(s:Strain)\n",
    "RETURN s.name as Strain\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
