{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "# Create Knowledge Graph for Novel Coronavirus (COVID-19) Outbreak¶"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "import os\n",
    "from py2neo import Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Open Graph data base"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(password=\"neo4jbinder\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Remove any existing nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x111cdc3a0>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"MATCH (n) DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Make sure that the core entities are unique"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x111ceff40>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"CREATE CONSTRAINT ON (c:City) ASSERT c.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (s:State) ASSERT s.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (k:Country) ASSERT k.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (r:Strain) ASSERT r.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (i:InfectiousDiseaseOutbreak) ASSERT i.name IS UNIQUE\")\n",
    "graph.run(\"CREATE CONSTRAINT ON (p:Pathogen) ASSERT p.name IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get absolute path for data directory (LOAD CSV requires absolute path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "data_dir = os.path.abspath(\"../data\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create City-level nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x111cdc760>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_city = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/city_COVID-19.csv' AS e\"\n",
    "query = \"\"\"\n",
    "MERGE (c:City {name:e.City})\n",
    "SET c.location = point({longitude: toFloat(e.Long), latitude: toFloat(e.Lat)})   \n",
    "MERGE (s:State {name:e.State})\n",
    "MERGE (k:Country {name:e.Country})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name:e.Outbreak})\n",
    "        \n",
    "MERGE (c)-[:LOCATED_IN]->(s)\n",
    "MERGE (s)-[:LOCATED_IN]->(k)\n",
    "MERGE (o)-[i:OCCURED_IN {update:e.`Last Update`}]->(c)\n",
    "SET i.confirmed = toInt(e.Confirmed),\n",
    "    i.deaths = toInt(e.Deaths), \n",
    "    i.recovered = toInt(e.Recovered)\n",
    "\"\"\"\n",
    "graph.run(load_city + query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run some test queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>City</th>\n",
       "      <th>Location</th>\n",
       "      <th>State</th>\n",
       "      <th>Country</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Lackland</td>\n",
       "      <td>(-98.6134, 29.3829)</td>\n",
       "      <td>Lackland, TX (From Diamond Princess)</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Santa Rosa County</td>\n",
       "      <td>(-86.9824, 30.769000000000002)</td>\n",
       "      <td>Florida</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hillsborough</td>\n",
       "      <td>(-82.3018, 27.9904)</td>\n",
       "      <td>Florida</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Sarasota</td>\n",
       "      <td>(-82.5307, 27.3364)</td>\n",
       "      <td>Florida</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Westchester County</td>\n",
       "      <td>(-73.7949, 41.122)</td>\n",
       "      <td>New York</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Queens County</td>\n",
       "      <td>(-73.7949, 40.7282)</td>\n",
       "      <td>New York</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>New York City</td>\n",
       "      <td>(-74.006, 40.7128)</td>\n",
       "      <td>New York</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>King County</td>\n",
       "      <td>(-122.3321, 47.6062)</td>\n",
       "      <td>Washington</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Snohomish County</td>\n",
       "      <td>(-121.8339, 48.033)</td>\n",
       "      <td>Washington</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Grant County</td>\n",
       "      <td>(-119.3732, 47.1981)</td>\n",
       "      <td>Washington</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>San Francisco County</td>\n",
       "      <td>(-122.4194, 37.7749)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>San Benito</td>\n",
       "      <td>(-120.9876, 36.5761)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Placer County</td>\n",
       "      <td>(-120.8039, 39.0916)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>San Mateo</td>\n",
       "      <td>(-122.3255, 37.563)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Orange County</td>\n",
       "      <td>(-117.8531, 33.7879)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Humboldt County</td>\n",
       "      <td>(-123.8695, 40.745)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Santa Clara</td>\n",
       "      <td>(-121.9552, 37.3541)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>San Diego County</td>\n",
       "      <td>(-117.1611, 32.7157)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Sacramento County</td>\n",
       "      <td>(-121.3542, 38.4747)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Contra Costa County</td>\n",
       "      <td>(-121.9018, 37.8534)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>(-118.2437, 34.0522)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>(-122.273, 37.8715)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Sonoma County</td>\n",
       "      <td>(-122.9888, 38.578)</td>\n",
       "      <td>California</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Washington County</td>\n",
       "      <td>(-123.1386, 45.547)</td>\n",
       "      <td>Oregon</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Umatilla</td>\n",
       "      <td>(-118.7606, 45.775)</td>\n",
       "      <td>Oregon</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Clark County</td>\n",
       "      <td>(-115.094, 36.0796)</td>\n",
       "      <td>Nevada</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>San Antonio</td>\n",
       "      <td>(-98.4936, 29.4241)</td>\n",
       "      <td>Texas</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Harris County</td>\n",
       "      <td>(-95.3103, 29.7752)</td>\n",
       "      <td>Texas</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Fort Bend County</td>\n",
       "      <td>(-95.8143, 29.5693)</td>\n",
       "      <td>Texas</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Omaha</td>\n",
       "      <td>(-95.9758, 41.2545)</td>\n",
       "      <td>Omaha, NE (From Diamond Princess)</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Providence</td>\n",
       "      <td>(-71.4128, 41.824)</td>\n",
       "      <td>Rhode Island</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Fulton County</td>\n",
       "      <td>(-84.3963, 33.8034)</td>\n",
       "      <td>Georgia</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Cook County</td>\n",
       "      <td>(-87.6976, 41.7377)</td>\n",
       "      <td>Illinois</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Wake County</td>\n",
       "      <td>(-78.5661, 35.8032)</td>\n",
       "      <td>North Carolina</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Boston</td>\n",
       "      <td>(-71.0589, 42.3601)</td>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Norfolk County</td>\n",
       "      <td>(-71.1449, 42.1767)</td>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Travis</td>\n",
       "      <td>(-121.9399, 38.2721)</td>\n",
       "      <td>Travis, CA (From Diamond Princess)</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Williamson County</td>\n",
       "      <td>(-86.8622, 35.9179)</td>\n",
       "      <td>Tennessee</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>Madison</td>\n",
       "      <td>(-89.4012, 43.0731)</td>\n",
       "      <td>Wisconsin</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>Bergen County</td>\n",
       "      <td>(-74.077, 40.9263)</td>\n",
       "      <td>New Jersey</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>Tempe</td>\n",
       "      <td>(-111.94, 33.4255)</td>\n",
       "      <td>Arizona</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>Maricopa County</td>\n",
       "      <td>(-112.4291, 33.2918)</td>\n",
       "      <td>Arizona</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Grafton County</td>\n",
       "      <td>(-71.82600000000002, 43.9088)</td>\n",
       "      <td>New Hampshire</td>\n",
       "      <td>USA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Toronto</td>\n",
       "      <td>(-79.3832, 43.6532)</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>Canada</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>London</td>\n",
       "      <td>(-81.2453, 42.9849)</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>Canada</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>Montreal</td>\n",
       "      <td>(-73.5673, 45.5017)</td>\n",
       "      <td>Quebec</td>\n",
       "      <td>Canada</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                    City                        Location  \\\n",
       "0               Lackland             (-98.6134, 29.3829)   \n",
       "1      Santa Rosa County  (-86.9824, 30.769000000000002)   \n",
       "2           Hillsborough             (-82.3018, 27.9904)   \n",
       "3               Sarasota             (-82.5307, 27.3364)   \n",
       "4     Westchester County              (-73.7949, 41.122)   \n",
       "5          Queens County             (-73.7949, 40.7282)   \n",
       "6          New York City              (-74.006, 40.7128)   \n",
       "7            King County            (-122.3321, 47.6062)   \n",
       "8       Snohomish County             (-121.8339, 48.033)   \n",
       "9           Grant County            (-119.3732, 47.1981)   \n",
       "10  San Francisco County            (-122.4194, 37.7749)   \n",
       "11            San Benito            (-120.9876, 36.5761)   \n",
       "12         Placer County            (-120.8039, 39.0916)   \n",
       "13             San Mateo             (-122.3255, 37.563)   \n",
       "14         Orange County            (-117.8531, 33.7879)   \n",
       "15       Humboldt County             (-123.8695, 40.745)   \n",
       "16           Santa Clara            (-121.9552, 37.3541)   \n",
       "17      San Diego County            (-117.1611, 32.7157)   \n",
       "18     Sacramento County            (-121.3542, 38.4747)   \n",
       "19   Contra Costa County            (-121.9018, 37.8534)   \n",
       "20           Los Angeles            (-118.2437, 34.0522)   \n",
       "21              Berkeley             (-122.273, 37.8715)   \n",
       "22         Sonoma County             (-122.9888, 38.578)   \n",
       "23     Washington County             (-123.1386, 45.547)   \n",
       "24              Umatilla             (-118.7606, 45.775)   \n",
       "25          Clark County             (-115.094, 36.0796)   \n",
       "26           San Antonio             (-98.4936, 29.4241)   \n",
       "27         Harris County             (-95.3103, 29.7752)   \n",
       "28      Fort Bend County             (-95.8143, 29.5693)   \n",
       "29                 Omaha             (-95.9758, 41.2545)   \n",
       "30            Providence              (-71.4128, 41.824)   \n",
       "31         Fulton County             (-84.3963, 33.8034)   \n",
       "32           Cook County             (-87.6976, 41.7377)   \n",
       "33           Wake County             (-78.5661, 35.8032)   \n",
       "34                Boston             (-71.0589, 42.3601)   \n",
       "35        Norfolk County             (-71.1449, 42.1767)   \n",
       "36                Travis            (-121.9399, 38.2721)   \n",
       "37     Williamson County             (-86.8622, 35.9179)   \n",
       "38               Madison             (-89.4012, 43.0731)   \n",
       "39         Bergen County              (-74.077, 40.9263)   \n",
       "40                 Tempe              (-111.94, 33.4255)   \n",
       "41       Maricopa County            (-112.4291, 33.2918)   \n",
       "42        Grafton County   (-71.82600000000002, 43.9088)   \n",
       "43               Toronto             (-79.3832, 43.6532)   \n",
       "44                London             (-81.2453, 42.9849)   \n",
       "45              Montreal             (-73.5673, 45.5017)   \n",
       "\n",
       "                                   State Country  \n",
       "0   Lackland, TX (From Diamond Princess)     USA  \n",
       "1                                Florida     USA  \n",
       "2                                Florida     USA  \n",
       "3                                Florida     USA  \n",
       "4                               New York     USA  \n",
       "5                               New York     USA  \n",
       "6                               New York     USA  \n",
       "7                             Washington     USA  \n",
       "8                             Washington     USA  \n",
       "9                             Washington     USA  \n",
       "10                            California     USA  \n",
       "11                            California     USA  \n",
       "12                            California     USA  \n",
       "13                            California     USA  \n",
       "14                            California     USA  \n",
       "15                            California     USA  \n",
       "16                            California     USA  \n",
       "17                            California     USA  \n",
       "18                            California     USA  \n",
       "19                            California     USA  \n",
       "20                            California     USA  \n",
       "21                            California     USA  \n",
       "22                            California     USA  \n",
       "23                                Oregon     USA  \n",
       "24                                Oregon     USA  \n",
       "25                                Nevada     USA  \n",
       "26                                 Texas     USA  \n",
       "27                                 Texas     USA  \n",
       "28                                 Texas     USA  \n",
       "29     Omaha, NE (From Diamond Princess)     USA  \n",
       "30                          Rhode Island     USA  \n",
       "31                               Georgia     USA  \n",
       "32                              Illinois     USA  \n",
       "33                        North Carolina     USA  \n",
       "34                         Massachusetts     USA  \n",
       "35                         Massachusetts     USA  \n",
       "36    Travis, CA (From Diamond Princess)     USA  \n",
       "37                             Tennessee     USA  \n",
       "38                             Wisconsin     USA  \n",
       "39                            New Jersey     USA  \n",
       "40                               Arizona     USA  \n",
       "41                               Arizona     USA  \n",
       "42                         New Hampshire     USA  \n",
       "43                               Ontario  Canada  \n",
       "44                               Ontario  Canada  \n",
       "45                                Quebec  Canada  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (c:City)-[l1:LOCATED_IN]->(s:State)-[l2:LOCATED_IN]->(k:Country)\n",
    "RETURN c.name as City, c.location as Location, s.name as State, k.name as Country\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>City</th>\n",
       "      <th>State</th>\n",
       "      <th>Outbreak</th>\n",
       "      <th>Confirmed</th>\n",
       "      <th>Deaths</th>\n",
       "      <th>Recovered</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Williamson County</td>\n",
       "      <td>Tennessee</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bergen County</td>\n",
       "      <td>New Jersey</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Santa Clara</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>20</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>11</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Wake County</td>\n",
       "      <td>North Carolina</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Washington County</td>\n",
       "      <td>Oregon</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Toronto</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>21</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Contra Costa County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>London</td>\n",
       "      <td>Ontario</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Fulton County</td>\n",
       "      <td>Georgia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Westchester County</td>\n",
       "      <td>New York</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Humboldt County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Lackland</td>\n",
       "      <td>Lackland, TX (From Diamond Princess)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>San Diego County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Maricopa County</td>\n",
       "      <td>Arizona</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Travis</td>\n",
       "      <td>Travis, CA (From Diamond Princess)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Queens County</td>\n",
       "      <td>New York</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Clark County</td>\n",
       "      <td>Nevada</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Berkeley</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Harris County</td>\n",
       "      <td>Texas</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Montreal</td>\n",
       "      <td>Quebec</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Tempe</td>\n",
       "      <td>Arizona</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Orange County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Madison</td>\n",
       "      <td>Wisconsin</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>San Antonio</td>\n",
       "      <td>Texas</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Omaha</td>\n",
       "      <td>Omaha, NE (From Diamond Princess)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Boston</td>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Providence</td>\n",
       "      <td>Rhode Island</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Sonoma County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>San Benito</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Hillsborough</td>\n",
       "      <td>Florida</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>San Francisco County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Santa Rosa County</td>\n",
       "      <td>Florida</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>King County</td>\n",
       "      <td>Washington</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>51</td>\n",
       "      <td>10</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Umatilla</td>\n",
       "      <td>Oregon</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Grafton County</td>\n",
       "      <td>New Hampshire</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Norfolk County</td>\n",
       "      <td>Massachusetts</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Grant County</td>\n",
       "      <td>Washington</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>New York City</td>\n",
       "      <td>New York</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>Sarasota</td>\n",
       "      <td>Florida</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>Sacramento County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>Placer County</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>Cook County</td>\n",
       "      <td>Illinois</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>Fort Bend County</td>\n",
       "      <td>Texas</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>San Mateo</td>\n",
       "      <td>California</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>Snohomish County</td>\n",
       "      <td>Washington</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>18</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                    City                                 State  Outbreak  \\\n",
       "0      Williamson County                             Tennessee  COVID-19   \n",
       "1          Bergen County                            New Jersey  COVID-19   \n",
       "2            Santa Clara                            California  COVID-19   \n",
       "3            Los Angeles                            California  COVID-19   \n",
       "4            Wake County                        North Carolina  COVID-19   \n",
       "5      Washington County                                Oregon  COVID-19   \n",
       "6                Toronto                               Ontario  COVID-19   \n",
       "7    Contra Costa County                            California  COVID-19   \n",
       "8                 London                               Ontario  COVID-19   \n",
       "9          Fulton County                               Georgia  COVID-19   \n",
       "10    Westchester County                              New York  COVID-19   \n",
       "11       Humboldt County                            California  COVID-19   \n",
       "12              Lackland  Lackland, TX (From Diamond Princess)  COVID-19   \n",
       "13      San Diego County                            California  COVID-19   \n",
       "14       Maricopa County                               Arizona  COVID-19   \n",
       "15                Travis    Travis, CA (From Diamond Princess)  COVID-19   \n",
       "16         Queens County                              New York  COVID-19   \n",
       "17          Clark County                                Nevada  COVID-19   \n",
       "18              Berkeley                            California  COVID-19   \n",
       "19         Harris County                                 Texas  COVID-19   \n",
       "20              Montreal                                Quebec  COVID-19   \n",
       "21                 Tempe                               Arizona  COVID-19   \n",
       "22         Orange County                            California  COVID-19   \n",
       "23               Madison                             Wisconsin  COVID-19   \n",
       "24           San Antonio                                 Texas  COVID-19   \n",
       "25                 Omaha     Omaha, NE (From Diamond Princess)  COVID-19   \n",
       "26                Boston                         Massachusetts  COVID-19   \n",
       "27            Providence                          Rhode Island  COVID-19   \n",
       "28         Sonoma County                            California  COVID-19   \n",
       "29            San Benito                            California  COVID-19   \n",
       "30          Hillsborough                               Florida  COVID-19   \n",
       "31  San Francisco County                            California  COVID-19   \n",
       "32     Santa Rosa County                               Florida  COVID-19   \n",
       "33           King County                            Washington  COVID-19   \n",
       "34              Umatilla                                Oregon  COVID-19   \n",
       "35        Grafton County                         New Hampshire  COVID-19   \n",
       "36        Norfolk County                         Massachusetts  COVID-19   \n",
       "37          Grant County                            Washington  COVID-19   \n",
       "38         New York City                              New York  COVID-19   \n",
       "39              Sarasota                               Florida  COVID-19   \n",
       "40     Sacramento County                            California  COVID-19   \n",
       "41         Placer County                            California  COVID-19   \n",
       "42           Cook County                              Illinois  COVID-19   \n",
       "43      Fort Bend County                                 Texas  COVID-19   \n",
       "44             San Mateo                            California  COVID-19   \n",
       "45      Snohomish County                            Washington  COVID-19   \n",
       "\n",
       "    Confirmed  Deaths  Recovered  \n",
       "0           1       0          0  \n",
       "1           2       0          0  \n",
       "2          20       0          1  \n",
       "3          11       0          0  \n",
       "4           1       0          0  \n",
       "5           2       0          0  \n",
       "6          21       0          2  \n",
       "7           1       0          0  \n",
       "8           1       0          1  \n",
       "9           2       0          0  \n",
       "10         18       0          0  \n",
       "11          1       0          0  \n",
       "12          0       0          0  \n",
       "13          3       0          1  \n",
       "14          1       0          0  \n",
       "15          0       0          0  \n",
       "16          1       0          0  \n",
       "17          1       0          0  \n",
       "18          1       0          0  \n",
       "19          2       0          0  \n",
       "20          2       0          0  \n",
       "21          1       0          1  \n",
       "22          3       0          0  \n",
       "23          1       0          1  \n",
       "24          1       0          0  \n",
       "25          0       0          0  \n",
       "26          1       0          1  \n",
       "27          2       0          0  \n",
       "28          1       0          0  \n",
       "29          2       0          0  \n",
       "30          2       0          0  \n",
       "31          2       0          0  \n",
       "32          1       0          0  \n",
       "33         51      10          1  \n",
       "34          1       0          0  \n",
       "35          2       0          0  \n",
       "36          1       0          0  \n",
       "37          1       0          0  \n",
       "38          4       0          0  \n",
       "39          1       0          0  \n",
       "40          2       0          0  \n",
       "41          2       1          0  \n",
       "42          5       0          2  \n",
       "43          1       0          0  \n",
       "44          2       0          0  \n",
       "45         18       1          0  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)-[l:OCCURED_IN]->(c:City)-[:LOCATED_IN]->(s:State)\n",
    "RETURN  c.name as City, s.name as State, o.name as Outbreak, l.confirmed as Confirmed, l.deaths as Deaths, l.recovered as Recovered\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create State-level nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x121200250>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_state = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/state_COVID-19.csv' AS e\" \n",
    "query = \"\"\"\n",
    "MERGE (s:State {name:e.State}) \n",
    "SET s.location = point({longitude: toFloat(e.Long), latitude: toFloat(e.Lat)})  \n",
    "MERGE (k:Country {name:e.Country})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name:e.Outbreak})\n",
    "        \n",
    "MERGE (s)-[:LOCATED_IN]->(k)\n",
    "MERGE (o)-[i:OCCURED_IN {update:e.`Last Update`}]->(s)\n",
    "SET i.confirmed = toInt(e.Confirmed),\n",
    "    i.deaths = toInt(e.Deaths), \n",
    "    i.recovered = toInt(e.Recovered)\n",
    "\"\"\"\n",
    "graph.run(load_state + query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run a test query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Location</th>\n",
       "      <th>Country</th>\n",
       "      <th>Outbreak</th>\n",
       "      <th>Confirmed</th>\n",
       "      <th>Deaths</th>\n",
       "      <th>Recovered</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>(114.2, 22.3)</td>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>105</td>\n",
       "      <td>2</td>\n",
       "      <td>43</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Macau</td>\n",
       "      <td>(113.55, 22.1667)</td>\n",
       "      <td>Macau</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>10</td>\n",
       "      <td>0</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Taiwan</td>\n",
       "      <td>(121.0, 23.7)</td>\n",
       "      <td>Taiwan</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>44</td>\n",
       "      <td>1</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Unassigned Location (From Diamond Princess)</td>\n",
       "      <td>(139.638, 35.4437)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>45</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Lackland, TX (From Diamond Princess)</td>\n",
       "      <td>(-98.6134, 29.3829)</td>\n",
       "      <td>USA</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>(144.9631, -37.8136)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>10</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>Western Australia</td>\n",
       "      <td>(115.8605, -31.9505)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Queensland</td>\n",
       "      <td>(153.4, -28.0167)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>13</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>South Australia</td>\n",
       "      <td>(138.6007, -34.9285)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>From Diamond Princess</td>\n",
       "      <td>(139.638, 35.4437)</td>\n",
       "      <td>Australia</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>67 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          State              Location  \\\n",
       "0                                     Hong Kong         (114.2, 22.3)   \n",
       "1                                         Macau     (113.55, 22.1667)   \n",
       "2                                        Taiwan         (121.0, 23.7)   \n",
       "3   Unassigned Location (From Diamond Princess)    (139.638, 35.4437)   \n",
       "4          Lackland, TX (From Diamond Princess)   (-98.6134, 29.3829)   \n",
       "..                                          ...                   ...   \n",
       "62                                     Victoria  (144.9631, -37.8136)   \n",
       "63                            Western Australia  (115.8605, -31.9505)   \n",
       "64                                   Queensland     (153.4, -28.0167)   \n",
       "65                              South Australia  (138.6007, -34.9285)   \n",
       "66                        From Diamond Princess    (139.638, 35.4437)   \n",
       "\n",
       "      Country  Outbreak  Confirmed  Deaths  Recovered  \n",
       "0   Hong Kong  COVID-19        105       2         43  \n",
       "1       Macau  COVID-19         10       0          9  \n",
       "2      Taiwan  COVID-19         44       1         12  \n",
       "3         USA  COVID-19         45       0          0  \n",
       "4         USA  COVID-19          0       0          0  \n",
       "..        ...       ...        ...     ...        ...  \n",
       "62  Australia  COVID-19         10       0          7  \n",
       "63  Australia  COVID-19          3       1          0  \n",
       "64  Australia  COVID-19         13       0          8  \n",
       "65  Australia  COVID-19          5       0          2  \n",
       "66  Australia  COVID-19          0       0          0  \n",
       "\n",
       "[67 rows x 7 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)-[l:OCCURED_IN]->(s:State)-[:LOCATED_IN]->(k:Country)\n",
    "RETURN  s.name as State, s.location as Location, k.name as Country, o.name as Outbreak, l.confirmed as Confirmed, l.deaths as Deaths, l.recovered as Recovered\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create Country-level nodes and relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x121408b20>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_country = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/country_COVID-19.csv' AS e\"  \n",
    "query = \"\"\"  \n",
    "MERGE (k:Country {name:e.Country})\n",
    "SET k.location = point({longitude: toFloat(e.Long), latitude: toFloat(e.Lat)})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name:e.Outbreak})\n",
    "        \n",
    "MERGE (o)-[i:OCCURED_IN {update:e.`Last Update`}]->(k)\n",
    "SET i.confirmed = toInt(e.Confirmed),\n",
    "    i.deaths = toInt(e.Deaths), \n",
    "    i.recovered = toInt(e.Recovered)\n",
    "\"\"\"\n",
    "graph.run(load_country + query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run a test query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Country</th>\n",
       "      <th>Location</th>\n",
       "      <th>Outbreak</th>\n",
       "      <th>Confirmed</th>\n",
       "      <th>Deaths</th>\n",
       "      <th>Recovered</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Iraq</td>\n",
       "      <td>(44.0, 33.0)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>35</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Brazil</td>\n",
       "      <td>(-51.9253, -14.235)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Philippines</td>\n",
       "      <td>(122.0, 13.0)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>China</td>\n",
       "      <td>(111.54290322580647, 33.40693612903225)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>80422</td>\n",
       "      <td>3013</td>\n",
       "      <td>52240</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Switzerland</td>\n",
       "      <td>(8.2275, 46.8182)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>114</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>Azerbaijan</td>\n",
       "      <td>(47.5769, 40.1431)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>6</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>Lithuania</td>\n",
       "      <td>(23.8813, 55.1694)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>Bahrain</td>\n",
       "      <td>(50.55, 26.0275)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>55</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>Iran</td>\n",
       "      <td>(53.0, 32.0)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>3513</td>\n",
       "      <td>107</td>\n",
       "      <td>739</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>Belarus</td>\n",
       "      <td>(27.9534, 53.7098)</td>\n",
       "      <td>COVID-19</td>\n",
       "      <td>6</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>90 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        Country                                 Location  Outbreak  Confirmed  \\\n",
       "0          Iraq                             (44.0, 33.0)  COVID-19         35   \n",
       "1        Brazil                      (-51.9253, -14.235)  COVID-19          4   \n",
       "2   Philippines                            (122.0, 13.0)  COVID-19          3   \n",
       "3         China  (111.54290322580647, 33.40693612903225)  COVID-19      80422   \n",
       "4   Switzerland                        (8.2275, 46.8182)  COVID-19        114   \n",
       "..          ...                                      ...       ...        ...   \n",
       "85   Azerbaijan                       (47.5769, 40.1431)  COVID-19          6   \n",
       "86    Lithuania                       (23.8813, 55.1694)  COVID-19          1   \n",
       "87      Bahrain                         (50.55, 26.0275)  COVID-19         55   \n",
       "88         Iran                             (53.0, 32.0)  COVID-19       3513   \n",
       "89      Belarus                       (27.9534, 53.7098)  COVID-19          6   \n",
       "\n",
       "    Deaths  Recovered  \n",
       "0        2          0  \n",
       "1        0          0  \n",
       "2        1          1  \n",
       "3     3013      52240  \n",
       "4        1          3  \n",
       "..     ...        ...  \n",
       "85       0          0  \n",
       "86       0          0  \n",
       "87       0          0  \n",
       "88     107        739  \n",
       "89       0          0  \n",
       "\n",
       "[90 rows x 6 columns]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)-[l:OCCURED_IN]->(k:Country)\n",
    "RETURN k.name as Country,k.location as Location, o.name as Outbreak, l.confirmed as Confirmed, l.deaths as Deaths, l.recovered as Recovered\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create nodes SARS and MERS data\n",
    "To be added in the future"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x121408cd0>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CREATE (s:InfectiousDiseaseOutbreak {name: 'SARS'})\n",
    "CREATE (m:InfectiousDiseaseOutbreak {name: 'MERS'})\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Outbreak</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SARS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>MERS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>COVID-19</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Outbreak\n",
       "0      SARS\n",
       "1      MERS\n",
       "2  COVID-19"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (o:InfectiousDiseaseOutbreak)\n",
    "RETURN o.name as Outbreak\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add taxonomy data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x111cefd60>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "SET p.taxonomyId = '269749'\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: 'COVID-19'})\n",
    "\n",
    "MERGE (p)-[:CAUSES]->(o)\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add strain data at City level"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x1214089a0>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_strains_city = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/strains_city_COVID-19.csv' AS e\" \n",
    "query = \"\"\"  \n",
    "MERGE (c:City {name:e.City})\n",
    "MERGE (s:Strain {name:e.strain})\n",
    "SET s.genbankId = e.genbank_accession\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: '2019-nCoV'})\n",
    "        \n",
    "MERGE (s)-[:FOUND_IN]->(c)\n",
    "MERGE (p)-[:HAS_STRAIN]->(s)\n",
    "\"\"\"\n",
    "graph.run(load_strains_city + query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>City</th>\n",
       "      <th>Strain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>King County</td>\n",
       "      <td>USA/WA-S2/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Snohomish County</td>\n",
       "      <td>USA/WA1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Snohomish County</td>\n",
       "      <td>USA/WA2/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Los Angeles</td>\n",
       "      <td>USA/CA1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Orange County</td>\n",
       "      <td>USA/CA2/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Boston</td>\n",
       "      <td>USA/MA1/2020</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               City          Strain\n",
       "0       King County  USA/WA-S2/2020\n",
       "1  Snohomish County    USA/WA1/2020\n",
       "2  Snohomish County    USA/WA2/2020\n",
       "3       Los Angeles    USA/CA1/2020\n",
       "4     Orange County    USA/CA2/2020\n",
       "5            Boston    USA/MA1/2020"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s: Strain)-[:FOUND_IN]->(c:City)\n",
    "RETURN c.name as City, s.name as Strain\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add strain data at State level"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x121467040>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_strains_country = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/strains_state_COVID-19.csv' AS e\"  \n",
    "query = \"\"\"  \n",
    "MERGE (st:State {name:e.State})\n",
    "MERGE (s:Strain {name:e.strain})\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: 'COVID-19'})\n",
    "        \n",
    "MERGE (s)-[:FOUND_IN]->(st)\n",
    "MERGE (p)-[:HAS_STRAIN]->(s)\n",
    "\"\"\"\n",
    "graph.run(load_strains_country + query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>State</th>\n",
       "      <th>Strain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Fujian</td>\n",
       "      <td>Fujian/8/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Fujian</td>\n",
       "      <td>Fujian/13/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>pangolin/Guangdong/P2S/2019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>Guangzhou/20SF206/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Guangdong</td>\n",
       "      <td>Shenzhen/SZTH-004/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>132</th>\n",
       "      <td>Beijing</td>\n",
       "      <td>Beijing/IVDC-BJ-005/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>133</th>\n",
       "      <td>British Columbia</td>\n",
       "      <td>Canada/BC_37_0-2/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>134</th>\n",
       "      <td>Chongqing</td>\n",
       "      <td>Chongqing/IVDC-CQ-001/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>135</th>\n",
       "      <td>Chongqing</td>\n",
       "      <td>Chongqing/YC01/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>136</th>\n",
       "      <td>Chongqing</td>\n",
       "      <td>Chongqing/ZX01/2020</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>137 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                State                       Strain\n",
       "0              Fujian                Fujian/8/2020\n",
       "1              Fujian               Fujian/13/2020\n",
       "2           Guangdong  pangolin/Guangdong/P2S/2019\n",
       "3           Guangdong       Guangzhou/20SF206/2020\n",
       "4           Guangdong       Shenzhen/SZTH-004/2020\n",
       "..                ...                          ...\n",
       "132           Beijing     Beijing/IVDC-BJ-005/2020\n",
       "133  British Columbia        Canada/BC_37_0-2/2020\n",
       "134         Chongqing   Chongqing/IVDC-CQ-001/2020\n",
       "135         Chongqing          Chongqing/YC01/2020\n",
       "136         Chongqing          Chongqing/ZX01/2020\n",
       "\n",
       "[137 rows x 2 columns]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s: Strain)-[:FOUND_IN]->(st:State)\n",
    "RETURN st.name as State, s.name as Strain\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Add strain data at Country level"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x121467eb0>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_strains_country = f\"LOAD CSV WITH HEADERS FROM 'file:///{data_dir}/strains_country_COVID-19.csv' AS e\"\n",
    "query = \"\"\"  \n",
    "MERGE (k:Country {name:e.Country})\n",
    "MERGE (s:Strain {name:e.strain})\n",
    "MERGE (p: Pathogen{name: 'Wuhan seafood market pneumonia virus'})\n",
    "MERGE (o:InfectiousDiseaseOutbreak {name: 'COVID-19'})\n",
    "        \n",
    "MERGE (s)-[:FOUND_IN]->(k)\n",
    "MERGE (p)-[:HAS_STRAIN]->(s)\n",
    "\"\"\"\n",
    "graph.run(load_strains_country + query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Country</th>\n",
       "      <th>Strain</th>\n",
       "      <th>GenbankId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>HongKong/VB20026565/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>HongKong/VM20001061/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hong Kong</td>\n",
       "      <td>HongKong/VM20001988/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Taiwan</td>\n",
       "      <td>Taiwan/3/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Taiwan</td>\n",
       "      <td>Taiwan/CGMH-CGU-01/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>204</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/NSW06/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>205</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/QLD02/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>206</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/QLD04/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>207</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Australia/NSW01/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>208</th>\n",
       "      <td>Australia</td>\n",
       "      <td>Sydney/2/2020</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>209 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       Country                    Strain GenbankId\n",
       "0    Hong Kong  HongKong/VB20026565/2020      None\n",
       "1    Hong Kong  HongKong/VM20001061/2020      None\n",
       "2    Hong Kong  HongKong/VM20001988/2020      None\n",
       "3       Taiwan             Taiwan/3/2020      None\n",
       "4       Taiwan   Taiwan/CGMH-CGU-01/2020      None\n",
       "..         ...                       ...       ...\n",
       "204  Australia      Australia/NSW06/2020      None\n",
       "205  Australia      Australia/QLD02/2020      None\n",
       "206  Australia      Australia/QLD04/2020      None\n",
       "207  Australia      Australia/NSW01/2020      None\n",
       "208  Australia             Sydney/2/2020      None\n",
       "\n",
       "[209 rows x 3 columns]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (s: Strain)-[:FOUND_IN]->(k:Country)\n",
    "RETURN k.name as Country, s.name as Strain, s.genbankId as GenbankId\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Strain</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Korea/KCDC12/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Japan/TY-WK-012/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Switzerland/1000477377/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Brazil/SPBR-01/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Germany/Baden-Wuerttemberg-1/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>204</th>\n",
       "      <td>Wuhan/IPBCAMS-WH-05/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>205</th>\n",
       "      <td>Australia/VIC01/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>206</th>\n",
       "      <td>pangolin/Guangdong/P2S/2019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>207</th>\n",
       "      <td>China/WH-09/2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>208</th>\n",
       "      <td>Foshan/20SF210/2020</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>209 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                Strain\n",
       "0                    Korea/KCDC12/2020\n",
       "1                 Japan/TY-WK-012/2020\n",
       "2          Switzerland/1000477377/2020\n",
       "3                  Brazil/SPBR-01/2020\n",
       "4    Germany/Baden-Wuerttemberg-1/2020\n",
       "..                                 ...\n",
       "204           Wuhan/IPBCAMS-WH-05/2020\n",
       "205               Australia/VIC01/2020\n",
       "206        pangolin/Guangdong/P2S/2019\n",
       "207                   China/WH-09/2020\n",
       "208                Foshan/20SF210/2020\n",
       "\n",
       "[209 rows x 1 columns]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p: Pathogen)-[:HAS_STRAIN]-(s:Strain)\n",
    "RETURN s.name as Strain\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python [conda env:coronavirus-knowledge-graph]",
   "language": "python",
   "name": "conda-env-coronavirus-knowledge-graph-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
